# Решение уравнение теплопередачии на примере охлаждение кофе
# Основные параметры:
#  Температура кофе при получениии: 90 С
#  Обьем стакана : 300 мл
#  Молоко имеет начальную температуру 5
#  Обьем молока 50 мл
#  Тмпература окружащего воздуха 22 С
#  Через 30 мин температура кофе снижается до 70 C

 Уравнение теплоты выгляит следующим образом:
 Q = C * ΔT

  Q - Это количество теплоты (Джоуль)
 ΔT - Это изменение температуры (Цельси)
 C - Это тепловая масса обекта (ДЖ/С)

 Уравнение для вычисление тепловой масс обекта:
 C =m*c(с-это удельная теплоемкость материала, m-это вес обекта)

 Удельная теплоемкость кофе, вероятно, близка к воде и составляет 4.2КДж/г/C
 Предпологая , что плотность кофе, близка к плотности воды, которая составляет 1 г/мл, масса 300 мл
 кофе равна 300 г, а тепловая масса равна 1260 ДЖ/С

 Решение тепловой массы кофе:
 C = mc = 0.3 кг * 4200 ДЖ = 1260 ДЖ/C

Так, когда чашка кофе охлаждается с 90 С до 70 С, изменение температуры , ΔT составляет 20 С,
 что означает , что 25200 ДЖ тепловой энергии было передано о  чашки и кофе в окружащуюю среду

 Уравнение по решению количестве тепла переданного в окр среду:

Q = t * C = 20 мин * 1260 ДЖ/С

ЗАКОН ОХЛАЖДЕНИЕ НЬЮТОНА

Закон охлаждения Ньютона утверждает, что скорость изменения
температуры объекта пропорциональна разнице температур между
объектом и окружающей средой:

dT/dt = -r * (T-Tenv)

 t - время
 T = температура обьекта
 Tenv = температура окр среды
 r - константа, характерезующая скорость передачи тепла между обектом и окр средой






